Revit 2026 API

# GroupSetErase Method

---

Removes a specified group from the set.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Erase(
	Group item
)
```
```vb
Public Overridable Function Erase (
	item As Group
) As Integer
```
```cpp
public:
virtual int Erase(
	Group^ item
)
```
```fsharp
abstract Erase :
        item : Group -> int
override Erase :
        item : Group -> int
```

#### Parameters

item Group
    The group to be erased.

#### Return Value

Int32The number of groups that were erased from the set.

#### Reference

GroupSet Class

Autodesk.Revit.DB Namespace